---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalSetting.IsValidSpecificFittingAngle(System.Double)
source: html/3ba25c52-38b9-2908-c073-3632537977a6.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.IsValidSpecificFittingAngle Method

Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.

## Syntax (C#)
```csharp
public bool IsValidSpecificFittingAngle(
	double angle
)
```

## Parameters
- **angle** (`System.Double`) - The angle value (in degree).

## Returns
True if the given value is a valid specific fitting angle.